aws/amazon-freertos/projects/microchip/same70_xult/mplab/aws_demos/firmware/src/packs/ATSAME70Q21B_DFP/component/usart.h
/* -------- US_IDR : (USART Offset: 0x0C) ( /W 32) Interrupt Disable Register -------- */
#define US_IDR_Msk                            _U_(0x00000000)                                      /**< (US_IDR) Register Mask  */

/* USART mode */
#define US_IDR_USART_RXRDY_Pos                _U_(0)                                               /**< (US_IDR) RXRDY Interrupt Disable Position */
#define US_IDR_USART_RXRDY_Msk                (_U_(0x1) << US_IDR_USART_RXRDY_Pos)                 /**< (US_IDR) RXRDY Interrupt Disable Mask */
#define US_IDR_USART_RXRDY(value)             (US_IDR_USART_RXRDY_Msk & ((value) << US_IDR_USART_RXRDY_Pos))
#define US_IDR_USART_TXRDY_Pos                _U_(1)                                               /**< (US_IDR) TXRDY Interrupt Disable Position */
#define US_IDR_USART_TXRDY_Msk                (_U_(0x1) << US_IDR_USART_TXRDY_Pos)                 /**< (US_IDR) TXRDY Interrupt Disable Mask */
#define US_IDR_USART_TXRDY(value)             (US_IDR_USART_TXRDY_Msk & ((value) << US_IDR_USART_TXRDY_Pos))
#define US_IDR_USART_RXBRK_Pos                _U_(2)                                               /**< (US_IDR) Receiver Break Interrupt Disable Position */
#define US_IDR_USART_RXBRK_Msk                (_U_(0x1) << US_IDR_USART_RXBRK_Pos)                 /**< (US_IDR) Receiver Break Interrupt Disable Mask */
#define US_IDR_USART_RXBRK(value)             (US_IDR_USART_RXBRK_Msk & ((value) << US_IDR_USART_RXBRK_Pos))
#define US_IDR_USART_OVRE_Pos                 _U_(5)                                               /**< (US_IDR) Overrun Error Interrupt Enable Position */
#define US_IDR_USART_OVRE_Msk                 (_U_(0x1) << US_IDR_USART_OVRE_Pos)                  /**< (US_IDR) Overrun Error Interrupt Enable Mask */
#define US_IDR_USART_OVRE(value)              (US_IDR_USART_OVRE_Msk & ((value) << US_IDR_USART_OVRE_Pos))
#define US_IDR_USART_FRAME_Pos                _U_(6)                                               /**< (US_IDR) Framing Error Interrupt Disable Position */
#define US_IDR_USART_FRAME_Msk                (_U_(0x1) << US_IDR_USART_FRAME_Pos)                 /**< (US_IDR) Framing Error Interrupt Disable Mask */
#define US_IDR_USART_FRAME(value)             (US_IDR_USART_FRAME_Msk & ((value) << US_IDR_USART_FRAME_Pos))
#define US_IDR_USART_PARE_Pos                 _U_(7)                                               /**< (US_IDR) Parity Error Interrupt Disable Position */
#define US_IDR_USART_PARE_Msk                 (_U_(0x1) << US_IDR_USART_PARE_Pos)                  /**< (US_IDR) Parity Error Interrupt Disable Mask */
#define US_IDR_USART_PARE(value)              (US_IDR_USART_PARE_Msk & ((value) << US_IDR_USART_PARE_Pos))
#define US_IDR_USART_TIMEOUT_Pos              _U_(8)                                               /**< (US_IDR) Timeout Interrupt Disable Position */
#define US_IDR_USART_TIMEOUT_Msk              (_U_(0x1) << US_IDR_USART_TIMEOUT_Pos)               /**< (US_IDR) Timeout Interrupt Disable Mask */
#define US_IDR_USART_TIMEOUT(value)           (US_IDR_USART_TIMEOUT_Msk & ((value) << US_IDR_USART_TIMEOUT_Pos))
#define US_IDR_USART_TXEMPTY_Pos              _U_(9)                                               /**< (US_IDR) TXEMPTY Interrupt Disable Position */
#define US_IDR_USART_TXEMPTY_Msk              (_U_(0x1) << US_IDR_USART_TXEMPTY_Pos)               /**< (US_IDR) TXEMPTY Interrupt Disable Mask */
#define US_IDR_USART_TXEMPTY(value)           (US_IDR_USART_TXEMPTY_Msk & ((value) << US_IDR_USART_TXEMPTY_Pos))
#define US_IDR_USART_ITER_Pos                 _U_(10)                                              /**< (US_IDR) Max Number of Repetitions Reached Interrupt Disable Position */
#define US_IDR_USART_ITER_Msk                 (_U_(0x1) << US_IDR_USART_ITER_Pos)                  /**< (US_IDR) Max Number of Repetitions Reached Interrupt Disable Mask */
#define US_IDR_USART_ITER(value)              (US_IDR_USART_ITER_Msk & ((value) << US_IDR_USART_ITER_Pos))
#define US_IDR_USART_NACK_Pos                 _U_(13)                                              /**< (US_IDR) Non Acknowledge Interrupt Disable Position */
#define US_IDR_USART_NACK_Msk                 (_U_(0x1) << US_IDR_USART_NACK_Pos)                  /**< (US_IDR) Non Acknowledge Interrupt Disable Mask */
#define US_IDR_USART_NACK(value)              (US_IDR_USART_NACK_Msk & ((value) << US_IDR_USART_NACK_Pos))
#define US_IDR_USART_RIIC_Pos                 _U_(16)                                              /**< (US_IDR) Ring Indicator Input Change Disable Position */
#define US_IDR_USART_RIIC_Msk                 (_U_(0x1) << US_IDR_USART_RIIC_Pos)                  /**< (US_IDR) Ring Indicator Input Change Disable Mask */
#define US_IDR_USART_RIIC(value)              (US_IDR_USART_RIIC_Msk & ((value) << US_IDR_USART_RIIC_Pos))
#define US_IDR_USART_DSRIC_Pos                _U_(17)                                              /**< (US_IDR) Data Set Ready Input Change Disable Position */
#define US_IDR_USART_DSRIC_Msk                (_U_(0x1) << US_IDR_USART_DSRIC_Pos)                 /**< (US_IDR) Data Set Ready Input Change Disable Mask */
#define US_IDR_USART_DSRIC(value)             (US_IDR_USART_DSRIC_Msk & ((value) << US_IDR_USART_DSRIC_Pos))
#define US_IDR_USART_DCDIC_Pos                _U_(18)                                              /**< (US_IDR) Data Carrier Detect Input Change Interrupt Disable Position */
#define US_IDR_USART_DCDIC_Msk                (_U_(0x1) << US_IDR_USART_DCDIC_Pos)                 /**< (US_IDR) Data Carrier Detect Input Change Interrupt Disable Mask */
#define US_IDR_USART_DCDIC(value)             (US_IDR_USART_DCDIC_Msk & ((value) << US_IDR_USART_DCDIC_Pos))
#define US_IDR_USART_CTSIC_Pos                _U_(19)                                              /**< (US_IDR) Clear to Send Input Change Interrupt Disable Position */
#define US_IDR_USART_CTSIC_Msk                (_U_(0x1) << US_IDR_USART_CTSIC_Pos)                 /**< (US_IDR) Clear to Send Input Change Interrupt Disable Mask */
#define US_IDR_USART_CTSIC(value)             (US_IDR_USART_CTSIC_Msk & ((value) << US_IDR_USART_CTSIC_Pos))
#define US_IDR_USART_MANE_Pos                 _U_(24)                                              /**< (US_IDR) Manchester Error Interrupt Disable Position */
#define US_IDR_USART_MANE_Msk                 (_U_(0x1) << US_IDR_USART_MANE_Pos)                  /**< (US_IDR) Manchester Error Interrupt Disable Mask */
#define US_IDR_USART_MANE(value)              (US_IDR_USART_MANE_Msk & ((value) << US_IDR_USART_MANE_Pos))
#define US_IDR_USART_Msk                      _U_(0x010F27E7)                                       /**< (US_IDR_USART) Register Mask  */

/* SPI mode */
#define US_IDR_SPI_RXRDY_Pos                  _U_(0)                                               /**< (US_IDR) RXRDY Interrupt Disable Position */
#define US_IDR_SPI_RXRDY_Msk                  (_U_(0x1) << US_IDR_SPI_RXRDY_Pos)                   /**< (US_IDR) RXRDY Interrupt Disable Mask */
#define US_IDR_SPI_RXRDY(value)               (US_IDR_SPI_RXRDY_Msk & ((value) << US_IDR_SPI_RXRDY_Pos))
#define US_IDR_SPI_TXRDY_Pos                  _U_(1)                                               /**< (US_IDR) TXRDY Interrupt Disable Position */
#define US_IDR_SPI_TXRDY_Msk                  (_U_(0x1) << US_IDR_SPI_TXRDY_Pos)                   /**< (US_IDR) TXRDY Interrupt Disable Mask */
#define US_IDR_SPI_TXRDY(value)               (US_IDR_SPI_TXRDY_Msk & ((value) << US_IDR_SPI_TXRDY_Pos))
#define US_IDR_SPI_OVRE_Pos                   _U_(5)                                               /**< (US_IDR) Overrun Error Interrupt Enable Position */
#define US_IDR_SPI_OVRE_Msk                   (_U_(0x1) << US_IDR_SPI_OVRE_Pos)                    /**< (US_IDR) Overrun Error Interrupt Enable Mask */
#define US_IDR_SPI_OVRE(value)                (US_IDR_SPI_OVRE_Msk & ((value) << US_IDR_SPI_OVRE_Pos))
#define US_IDR_SPI_TXEMPTY_Pos                _U_(9)                                               /**< (US_IDR) TXEMPTY Interrupt Disable Position */
#define US_IDR_SPI_TXEMPTY_Msk                (_U_(0x1) << US_IDR_SPI_TXEMPTY_Pos)                 /**< (US_IDR) TXEMPTY Interrupt Disable Mask */
#define US_IDR_SPI_TXEMPTY(value)             (US_IDR_SPI_TXEMPTY_Msk & ((value) << US_IDR_SPI_TXEMPTY_Pos))
#define US_IDR_SPI_UNRE_Pos                   _U_(10)                                              /**< (US_IDR) SPI Underrun Error Interrupt Disable Position */
#define US_IDR_SPI_UNRE_Msk                   (_U_(0x1) << US_IDR_SPI_UNRE_Pos)                    /**< (US_IDR) SPI Underrun Error Interrupt Disable Mask */
#define US_IDR_SPI_UNRE(value)                (US_IDR_SPI_UNRE_Msk & ((value) << US_IDR_SPI_UNRE_Pos))
#define US_IDR_SPI_NSSE_Pos                   _U_(19)                                              /**< (US_IDR) NSS Line (Driving CTS Pin) Rising or Falling Edge Event Position */
#define US_IDR_SPI_NSSE_Msk                   (_U_(0x1) << US_IDR_SPI_NSSE_Pos)                    /**< (US_IDR) NSS Line (Driving CTS Pin) Rising or Falling Edge Event Mask */
#define US_IDR_SPI_NSSE(value)                (US_IDR_SPI_NSSE_Msk & ((value) << US_IDR_SPI_NSSE_Pos))
#define US_IDR_SPI_Msk                        _U_(0x00080623)                                       /**< (US_IDR_SPI) Register Mask  */

